export function foo():string[]{
  return ["hi"];
}
// מערך של אותיות זהות כמו ת,ט ק,כ א,ע
// מערך של אותיות לא החרכיות כמו ה,ו,י
// מערך של אוטוית קרובות על המקלדת
// פונקציה לניקוד דמיות עם התחשבות בהשמטת אות, לחיצה על אות קורבה
// אפשר לשמור בחירות ולעשות פרוייקט דאתא סיינס קטן שמציע בחירות לפי בחירות עבר
// שלב נוסף זה שיש לי מערך עם: ניקוד של כל התאמה החזקה ביותר והמיקום התחלה וסוף שלה
// אנחנו מסדרים את המערך על פי הניקוד ומדגישים מהנקודת התחלה לנקודת סוף
// לא לאבד את האי די בדרך כי בסוף זה מה שחשוב,

// const boldString = (str, substr) => str.replace(RegExp(substr, 'g'), `<b>${substr}</b>`);

// function boldString(str, substr) {
//   var strRegExp = new RegExp(substr, 'g');
//   return str.replace(strRegExp, '<b>'+substr+'</b>');
// }
